Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.inspector.retrievalScore.formula.keyword
source: score = (1.0 / (60 + keyword rank) + keyword score × 0.12) × source weight + preferred-repo boost
ar: الدرجة = (1.0 / (60 + رتبة الكلمات المفتاحية) + درجة الكلمات المفتاحية × 0.12) × وزن المصدر + تعزيز المستودع المفضل
de: Wertung = (1,0 / (60 + Keyword-Rang) + Keyword-Wertung × 0,12) × Quellgewicht + Bevorzugtes-Repo-Boost
es: puntuación = (1.0 / (60 + rango de palabras clave) + puntuación de palabras clave × 0.12) × peso de fuente + incremento de repositorio preferido
fr: score = (1,0 / (60 + rang mots-clés) + score mots-clés × 0,12) × poids source + bonus dépôt préféré
id: skor = (1,0 / (60 + peringkat kata kunci) + skor kata kunci × 0,12) × bobot sumber + dorongan repositori pilihan
it: punteggio = (1,0 / (60 + rango parole chiave) + punteggio parole chiave × 0,12) × peso fonte + boost repository preferito
ja: スコア = (1.0 / (60 + キーワード順位) + キーワードスコア × 0.12) × ソース重み + 優先リポジトリブースト
ko: 점수 = (1.0 / (60 + 키워드 순위) + 키워드 점수 × 0.12) × 소스 가중치 + 선호 저장소 부스트
nl: score = (1,0 / (60 + trefwoordrang) + trefwoordscore × 0,12) × brongewicht + voorkeursrepo-boost
pl: wynik = (1,0 / (60 + pozycja słów kluczowych) + wynik słów kluczowych × 0,12) × waga źródła + premia za preferowane repozytorium
pt_br: pontuação = (1,0 / (60 + classificação de palavra-chave) + pontuação de palavra-chave × 0,12) × peso da fonte + impulso de repositório preferido
ru: оценка = (1,0 / (60 + ранг ключевых слов) + оценка ключевых слов × 0,12) × вес источника + бонус предпочтительного репозитория
tr: puan = (1.0 / (60 + anahtar kelime sırası) + anahtar kelime puanı × 0.12) × kaynak ağırlığı + tercih edilen depo desteği
uk: оцінка = (1.0 / (60 + ранг ключових слів) + оцінка ключових слів × 0.12) × вага джерела + бонус улюбленого сховища
vi: điểm = (1.0 / (60 + hạng từ khóa) + điểm từ khóa × 0.12) × trọng số nguồn + thưởng kho ưa thích
zh_hans: 综合检索分 =（1.0 /（60 + 关键词排名）+ 字面命中分 × 0.12）× 来源权重 + @repo 偏好加成
zh_hant: 綜合檢索分 =（1.0 /（60 + 關鍵詞排名）+ 字面命中分 × 0.12）× 來源權重 + @repo 偏好加成

# rag.workspace.inspector.retrievalScore.formula.vector
source: score = (1.15 / (60 + vector rank) + cosine similarity × 0.20) × source weight + preferred-repo boost
ar: الدرجة = (1.15 / (60 + رتبة المتجه) + تشابه جيب التمام × 0.20) × وزن المصدر + تعزيز المستودع المفضل
de: Wertung = (1,15 / (60 + Vektor-Rang) + Kosinus-Ähnlichkeit × 0,20) × Quellgewicht + Bevorzugtes-Repo-Boost
es: puntuación = (1.15 / (60 + rango vectorial) + similitud coseno × 0.20) × peso de fuente + incremento de repositorio preferido
fr: score = (1,15 / (60 + rang vectoriel) + similarité cosinus × 0,20) × poids source + bonus dépôt préféré
id: skor = (1,15 / (60 + peringkat vektor) + kemiripan kosinus × 0,20) × bobot sumber + dorongan repositori pilihan
it: punteggio = (1,15 / (60 + rango vettore) + similarità coseno × 0,20) × peso fonte + boost repository preferito
ja: スコア = (1.15 / (60 + ベクトル順位) + コサイン類似度 × 0.20) × ソース重み + 優先リポジトリブースト
ko: 점수 = (1.15 / (60 + 벡터 순위) + 코사인 유사도 × 0.20) × 소스 가중치 + 선호 저장소 부스트
nl: score = (1,15 / (60 + vectorrang) + cosinusovereenkomst × 0,20) × brongewicht + voorkeursrepo-boost
pl: wynik = (1,15 / (60 + pozycja wektorów) + podobieństwo cosinusowe × 0,20) × waga źródła + premia za preferowane repozytorium
pt_br: pontuação = (1,15 / (60 + classificação vetorial) + similaridade de cosseno × 0,20) × peso da fonte + impulso de repositório preferido
ru: оценка = (1,15 / (60 + ранг вектора) + косинусное сходство × 0,20) × вес источника + бонус предпочтительного репозитория
tr: puan = (1.15 / (60 + vektör sırası) + kosinüs benzerliği × 0.20) × kaynak ağırlığı + tercih edilen depo desteği
uk: оцінка = (1.15 / (60 + ранг вектора) + косинусна подібність × 0.20) × вага джерела + бонус улюбленого сховища
vi: điểm = (1.15 / (60 + hạng vector) + tương đồng cosine × 0.20) × trọng số nguồn + thưởng kho ưa thích
zh_hans: 综合检索分 =（1.15 /（60 + 向量排名）+ 余弦相似度 × 0.20）× 来源权重 + @repo 偏好加成
zh_hant: 綜合檢索分 =（1.15 /（60 + 向量排名）+ 餘弦相似度 × 0.20）× 來源權重 + @repo 偏好加成

# rag.workspace.inspector.retrievalScore.formulaLabel
source: Calculation formula
ar: صيغة الحساب
de: Berechnungsformel
es: Fórmula de cálculo
fr: Formule de calcul
id: Rumus perhitungan
it: Formula di calcolo
ja: 計算式
ko: 계산 공식
nl: Berekeningsformule
pl: Wzór obliczeniowy
pt_br: Fórmula de cálculo
ru: Формула расчёта
tr: Hesaplama formülü
uk: Формула розрахунку
vi: Công thức tính
zh_hans: 计算公式
zh_hant: 計算公式

# rag.workspace.inspector.retrievalScore.help
source: Show score formula
ar: إظهار صيغة الدرجة
de: Wertungsformel anzeigen
es: Mostrar fórmula de puntuación
fr: Afficher la formule du score
id: Tampilkan rumus skor
it: Mostra formula punteggio
ja: スコア計算式を表示
ko: 점수 공식 보기
nl: Toon scoreformule
pl: Pokaż wzór wyniku
pt_br: Mostrar fórmula da pontuação
ru: Показать формулу оценки
tr: Puan formülünü göster
uk: Показати формулу оцінки
vi: Hiển thị công thức điểm
zh_hans: 查看计算公式
zh_hant: 查看計算公式

# rag.workspace.inspector.retrievalScore.keyword
source: Keyword score: the normalized rank of an exact text match; its weight is 0.12.
ar: درجة الكلمات المفتاحية: الرتبة المعيارية لتطابق نصي دقيق؛ وزنها 0.12.
de: Keyword-Wertung: der normalisierte Rang einer exakten Textübereinstimmung; sein Gewicht beträgt 0,12.
es: Puntuación de palabras clave: el rango normalizado de una coincidencia de texto exacta; su peso es 0.12.
fr: Score mots-clés : le rang normalisé d'une correspondance textuelle exacte ; son poids est de 0,12.
id: Skor kata kunci: peringkat normal dari kecocokan teks tepat; bobotnya 0,12.
it: Punteggio parole chiave: il rango normalizzato di una corrispondenza testuale esatta; il suo peso è 0,12.
ja: キーワードスコア：完全一致テキストの正規化された順位。重みは0.12。
ko: 키워드 점수: 정확한 텍스트 일치의 정규화된 순위; 가중치는 0.12입니다.
nl: Trefwoordscore: de genormaliseerde rang van een exacte tekstovereenkomst; het gewicht is 0,12.
pl: Wynik słów kluczowych: znormalizowana pozycja dokładnego dopasowania tekstu; jego waga wynosi 0,12.
pt_br: Pontuação de palavra-chave: a classificação normalizada de uma correspondência exata de texto; seu peso é 0,12.
ru: Оценка ключевых слов: нормализованный ранг точного текстового совпадения; его вес равен 0,12.
tr: Anahtar kelime puanı: tam metin eşleşmesinin normalleştirilmiş sırası; ağırlığı 0.12'dir.
uk: Оцінка ключових слів: нормалізований ранг точного збігу тексту; його вага — 0.12.
vi: Điểm từ khóa: hạng chuẩn hóa của khớp văn bản chính xác; trọng số là 0.12.
zh_hans: 字面命中分：严格文本匹配的归一化排名分，权重为 0.12。
zh_hant: 字面命中分：嚴格文字匹配的歸一化排名分，權重為 0.12。

# rag.workspace.inspector.retrievalScore.preferBoost
source: Preferred-repo boost: an explicit @repo preference adds 0.08; otherwise it is 0.
ar: تعزيز المستودع المفضل: تفضيل صريح @repo يضيف 0.08؛ وإلا فهو 0.
de: Bevorzugtes-Repo-Boost: eine explizite @repo-Präferenz fügt 0,08 hinzu; andernfalls ist es 0.
es: Incremento de repositorio preferido: una preferencia explícita @repo añade 0.08; de lo contrario es 0.
fr: Bonus dépôt préféré : une préférence explicite @repo ajoute 0,08 ; sinon 0.
id: Dorongan repositori pilihan: preferensi @repo eksplisit menambah 0,08; jika tidak, 0.
it: Boost repository preferito: una preferenza esplicita @repo aggiunge 0,08; altrimenti è 0.
ja: 優先リポジトリブースト：明示的な@repo指定で0.08追加。それ以外は0。
ko: 선호 저장소 부스트: 명시적 @repo 선호도는 0.08을 추가하며, 그렇지 않으면 0입니다.
nl: Voorkeursrepo-boost: een expliciete @repo-voorkeur voegt 0,08 toe; anders is het 0.
pl: Premia za preferowane repozytorium: jawne preferowanie @repo dodaje 0,08; w przeciwnym razie wynosi 0.
pt_br: Impulso de repositório preferido: uma preferência explícita @repo adiciona 0,08; caso contrário, é 0.
ru: Бонус предпочтительного репозитория: явное предпочтение @repo добавляет 0,08; иначе 0.
tr: Tercih edilen depo desteği: açık bir @repo tercihi 0.08 ekler; aksi halde 0'dır.
uk: Бонус улюбленого сховища: явна перевага @repo додає 0.08; інакше — 0.
vi: Thưởng kho ưa thích: ưu tiên @repo tường minh thêm 0.08; nếu không thì là 0.
zh_hans: 偏好加成：显式 @repo 偏好时额外加 0.08，否则为 0。
zh_hant: 偏好加成：顯式 @repo 偏好時額外加 0.08，否則為 0。

# rag.workspace.inspector.retrievalScore.rank
source: RRF rank term: weight / (60 + rank), so rank refines rather than dominates the result.
ar: حد رتبة RRF: الوزن / (60 + الرتبة)، لذا تنقح الرتبة النتيجة بدلاً من أن تهيمن عليها.
de: RRF-Rangbegriff: Gewicht / (60 + Rang), sodass der Rang das Ergebnis verfeinert, nicht dominiert.
es: Término de rango RRF: peso / (60 + rango), por lo que el rango refina en lugar de dominar el resultado.
fr: Terme de rang RRF : poids / (60 + rang), donc le rang affine plutôt que domine le résultat.
id: Istilah peringkat RRF: bobot / (60 + peringkat), sehingga peringkat menyempurnakan daripada mendominasi hasil.
it: Termine rango RRF: peso / (60 + rango), quindi il rango perfeziona piuttosto che dominare il risultato.
ja: RRF順位項：重み / (60 + 順位)。順位は結果を支配せずに調整する。
ko: RRF 순위 항: 가중치 / (60 + 순위)로, 순위가 결과를 세분화하지만 지배하지 않습니다.
nl: RRF-rangterm: gewicht / (60 + rang), dus rang verfijnt het resultaat in plaats van domineert.
pl: Termin pozycji RRF: waga / (60 + pozycja), więc pozycja udoskonala, a nie dominuje wyniku.
pt_br: Termo de classificação RRF: peso / (60 + classificação), para que a classificação refine em vez de dominar o resultado.
ru: Член RRF ранга: вес / (60 + ранг), поэтому ранг уточняет, а не доминирует над результатом.
tr: RRF sıra terimi: ağırlık / (60 + sıra), böylece sıra sonucu iyileştirir, domine etmez.
uk: Член рангу RRF: вага / (60 + ранг), тому ранг уточнює, а не домінує результат.
vi: Hạng RRF: trọng số / (60 + hạng), do đó hạng tinh chỉnh chứ không chi phối kết quả.
zh_hans: RRF 排名项：权重 /（60 + 排名），让排名只细化结果而不主导结果。
zh_hant: RRF 排名項：權重 /（60 + 排名），讓排名只細化結果而不主導結果。

# rag.workspace.inspector.retrievalScore.sourceWeight
source: Source weight: notes 1.18, summary 1.12, README 1.00, metadata 0.85.
ar: وزن المصدر: الملاحظات 1.18، الملخص 1.12، README 1.00، البيانات الوصفية 0.85.
de: Quellgewicht: Notizen 1,18, Zusammenfassung 1,12, README 1,00, Metadaten 0,85.
es: Peso de fuente: notas 1.18, resumen 1.12, README 1.00, metadatos 0.85.
fr: Poids source : notes 1,18, résumé 1,12, README 1,00, métadonnées 0,85.
id: Bobot sumber: catatan 1,18, ringkasan 1,12, README 1,00, metadata 0,85.
it: Peso fonte: note 1,18, riepilogo 1,12, README 1,00, metadati 0,85.
ja: ソース重み：ノート1.18、サマリー1.12、README 1.00、メタデータ0.85。
ko: 소스 가중치: 노트 1.18, 요약 1.12, README 1.00, 메타데이터 0.85.
nl: Brongewicht: notities 1,18, samenvatting 1,12, README 1,00, metadata 0,85.
pl: Waga źródła: notatki 1,18, podsumowanie 1,12, README 1,00, metadane 0,85.
pt_br: Peso da fonte: notas 1,18, resumo 1,12, README 1,00, metadados 0,85.
ru: Вес источника: заметки 1,18, сводка 1,12, README 1,00, метаданные 0,85.
tr: Kaynak ağırlığı: notlar 1.18, özet 1.12, README 1.00, meta veri 0.85.
uk: Вага джерела: нотатки 1.18, підсумок 1.12, README 1.00, метадані 0.85.
vi: Trọng số nguồn: ghi chú 1.18, tóm tắt 1.12, README 1.00, siêu dữ liệu 0.85.
zh_hans: 来源权重：笔记 1.18、摘要 1.12、README 1.00、元数据 0.85。
zh_hant: 來源權重：筆記 1.18、摘要 1.12、README 1.00、元資料 0.85。

# rag.workspace.inspector.retrievalScore.vectorWeight
source: Vector weight: cosine similarity is scaled by 0.20 before fusion.
ar: وزن المتجه: يتم قياس تشابه جيب التمام بـ 0.20 قبل الدمج.
de: Vektorgewicht: Kosinus-Ähnlichkeit wird vor der Fusion mit 0,20 skaliert.
es: Peso vectorial: la similitud coseno se escala por 0.20 antes de la fusión.
fr: Poids vectoriel : la similarité cosinus est mise à l'échelle par 0,20 avant fusion.
id: Bobot vektor: kemiripan kosinus diskalakan dengan 0,20 sebelum fusi.
it: Peso vettore: la similarità coseno è scalata per 0,20 prima della fusione.
ja: ベクトル重み：コサイン類似度は融合前に0.20でスケーリング。
ko: 벡터 가중치: 코사인 유사도는 퓨전 전에 0.20으로 조정됩니다.
nl: Vectorgewicht: cosinusovereenkomst wordt geschaald met 0,20 vóór fusie.
pl: Waga wektorów: podobieństwo cosinusowe jest skalowane przez 0,20 przed fuzją.
pt_br: Peso vetorial: a similaridade de cosseno é escalada por 0,20 antes da fusão.
ru: Вес вектора: косинусное сходство масштабируется на 0,20 перед слиянием.
tr: Vektör ağırlığı: kosinüs benzerliği füzyondan önce 0.20 ile ölçeklenir.
uk: Вага вектора: косинусна подібність масштабується на 0.20 перед злиттям.
vi: Trọng số vector: tương đồng cosine được nhân với 0.20 trước khi hợp nhất.
zh_hans: 向量权重：余弦相似度在融合前乘以 0.20。
zh_hant: 向量權重：餘弦相似度在融合前乘以 0.20。

# rag.workspace.inspector.semanticQuery
source: Optimized query
ar: استعلام محسّن
de: Optimierte Abfrage
es: Consulta optimizada
fr: Requête optimisée
id: Kueri yang dioptimalkan
it: Query ottimizzata
ja: 最適化クエリ
ko: 최적화된 쿼리
nl: Geoptimaliseerde query
pl: Zoptymalizowane zapytanie
pt_br: Consulta otimizada
ru: Оптимизированный запрос
tr: Optimize edilmiş sorgu
uk: Оптимізований запит
vi: Truy vấn tối ưu
zh_hans: 优化后的问题
zh_hant: 優化後的問題

# rag.workspace.inspector.source
source: Source
ar: المصدر
de: Quelle
es: Fuente
id: Sumber
it: Fonte
ja: ソース
ko: 소스
nl: Bron
pl: Źródło
pt_br: Fonte
ru: Источник
tr: Kaynak
uk: Джерело
vi: Nguồn
zh_hans: 来源
zh_hant: 來源

# rag.workspace.inspector.subtitle
source: Sources used in this answer
ar: المصادر المستخدمة في هذه الإجابة
de: In dieser Antwort verwendete Quellen
es: Fuentes utilizadas en esta respuesta
fr: Sources utilisées dans cette réponse
id: Sumber yang digunakan dalam jawaban ini
it: Fonti utilizzate in questa risposta
ja: この回答で使用されたソース
ko: 이 답변에 사용된 소스
nl: Bronnen gebruikt in dit antwoord
pl: Źródła użyte w tej odpowiedzi
pt_br: Fontes usadas nesta resposta
ru: Источники, использованные в этом ответе
tr: Bu yanıtta kullanılan kaynaklar
uk: Джерела, використані у цій відповіді
vi: Nguồn được dùng trong câu trả lời này
zh_hans: 本轮回答实际使用的来源
zh_hant: 本輪回答實際使用的來源

# rag.workspace.inspector.tab.debug
source: Debug
ar: تصحيح الأخطاء
es: Depurar
fr: Débogage
ja: デバッグ
ko: 디버그
pl: Debugowanie
pt_br: Depuração
ru: Отладка
tr: Hata Ayıklama
uk: Налагодження
vi: Gỡ lỗi
zh_hans: 调试
zh_hant: 除錯

# rag.workspace.inspector.tab.evidence
source: Citations
ar: الاقتباسات
de: Zitate
es: Citas
id: Kutipan
it: Citazioni
ja: 引用
ko: 인용
nl: Citaten
pl: Cytaty
pt_br: Citações
ru: Цитаты
tr: Alıntılar
uk: Цитування
vi: Trích dẫn
zh_hans: 引用
zh_hant: 引用

# rag.workspace.inspector.tab.index
source: Index
ar: الفهرس
es: Índice
id: Indeks
it: Indice
ja: インデックス
ko: 인덱스
pl: Indeks
pt_br: Índice
ru: Индекс
tr: Dizin
uk: Індекс
vi: Chỉ mục
zh_hans: 索引
zh_hant: 索引

# rag.workspace.inspector.tab.plan
source: Plan
ar: الخطة
id: Rencana
it: Piano
ja: 計画
ko: 계획
pt_br: Plano
ru: План
uk: План
vi: Kế hoạch
zh_hans: 计划
zh_hant: 計劃

# rag.workspace.inspector.title
source: Context
ar: السياق
de: Kontext
es: Contexto
fr: Contexte
id: Konteks
it: Contesto
ja: コンテキスト
ko: 컨텍스트
pl: Kontekst
pt_br: Contexto
ru: Контекст
tr: Bağlam
uk: Контекст
vi: Ngữ cảnh
zh_hans: 上下文
zh_hant: 上下文

# rag.workspace.inspector.vectorSimilarity
source: Vector similarity
ar: تشابه المتجهات
de: Vektorähnlichkeit
es: Similitud vectorial
fr: Similarité vectorielle
id: Kemiripan vektor
it: Similarità vettoriale
ja: ベクトル類似度
ko: 벡터 유사도
nl: Vectorovereenkomst
pl: Podobieństwo wektorowe
pt_br: Similaridade vetorial
ru: Векторное сходство
tr: Vektör benzerliği
uk: Векторна подібність
vi: Tương đồng vector
zh_hans: 向量相似度
zh_hant: 向量相似度

# rag.workspace.link.external
source: External GitHub link
ar: رابط GitHub خارجي
de: Externer GitHub-Link
es: Enlace externo a GitHub
fr: Lien GitHub externe
id: Tautan GitHub eksternal
it: Link GitHub esterno
ja: 外部GitHubリンク
ko: 외부 GitHub 링크
nl: Externe GitHub-link
pl: Zewnętrzny link GitHub
pt_br: Link externo do GitHub
ru: Внешняя ссылка на GitHub
tr: Harici GitHub bağlantısı
uk: Зовнішнє посилання GitHub
vi: Liên kết GitHub bên ngoài
zh_hans: 外部 GitHub 链接
zh_hant: 外部 GitHub 連結

# rag.workspace.link.knownButNotInLibrary
source: Known, not in knowledge base
ar: معروف، ليس في قاعدة المعرفة
de: Bekannt, nicht in der Wissensbasis
es: Conocido, no en la base de conocimiento
fr: Connu, pas dans la base de connaissances
id: Diketahui, tidak ada di basis pengetahuan
it: Conosciuto, non nella knowledge base
ja: 既知だがナレッジベースに未登録
ko: 알려져 있지만 지식 베이스에 없음
nl: Bekend, niet in kennisbank
pl: Znane, ale nie w bazie wiedzy
pt_br: Conhecido, não está na base de conhecimento
ru: Известно, но не в базе знаний
tr: Biliniyor, bilgi tabanında değil
uk: Відомо, але не в базі знань
vi: Đã biết, không có trong cơ sở tri thức
zh_hans: 已收藏，未入库
zh_hant: 已收藏，未入庫

# rag.workspace.mention.badge.aiSummary
source: AI summary available
ar: يتوفر ملخص AI
de: KI-Zusammenfassung verfügbar
es: Resumen de IA disponible
fr: Résumé IA disponible
id: Ringkasan AI tersedia
it: Riepilogo AI disponibile
ja: AIサマリー利用可能
ko: AI 요약 가능
nl: AI-samenvatting beschikbaar
pl: Dostępne podsumowanie AI
pt_br: Resumo de IA disponível
ru: Доступна сводка AI
tr: AI özeti mevcut
uk: Доступний AI-підсумок
vi: Có tóm tắt AI
zh_hans: 已有 AI 摘要
zh_hant: 已有 AI 摘要

# rag.workspace.mention.badge.chunks
source: %1$d chunks indexed
ar: %1$d أجزاء مفهرسة
de: %1$d Chunks indiziert
es: %1$d fragmentos indexados
fr: %1$d fragments indexés
id: %1$d potongan diindeks
it: %1$d blocchi indicizzati
ja: %1$d個のチャンクをインデックス
ko: %1$d개 청크 인덱싱됨
nl: %1$d chunks geïndexeerd
pl: Zindeksowano %1$d fragmentów
pt_br: %1$d trechos indexados
ru: Проиндексировано %1$d фрагментов
tr: %1$d parça dizinlendi
uk: Проіндексовано %1$d фрагментів
vi: %1$d đoạn đã được lập chỉ mục
zh_hans: %1$d 个分片
zh_hant: %1$d 個分片

# rag.workspace.mention.badge.privateNote
source: Private note available
ar: ملاحظة خاصة متاحة
de: Private Notiz verfügbar
es: Nota privada disponible
fr: Note privée disponible
id: Catatan pribadi tersedia
it: Nota privata disponibile
ja: プライベートノート利用可能
ko: 비공개 노트 사용 가능
nl: Privénotitie beschikbaar
pl: Prywatna notatka dostępna
pt_br: Nota privada disponível
ru: Доступна личная заметка
tr: Özel not mevcut
uk: Приватна нотатка доступна
vi: Có ghi chú riêng tư
zh_hans: 已有私有笔记
zh_hant: 已有私有筆記

# rag.workspace.mention.clearFilter
source: Clear filter
ar: مسح الفلتر
de: Filter löschen
es: Limpiar filtro
fr: Effacer le filtre
id: Hapus filter
it: Cancella filtro
ja: フィルタをクリア
ko: 필터 지우기
nl: Filter wissen
pl: Wyczyść filtr
pt_br: Limpar filtro
ru: Очистить фильтр
tr: Filtreyi temizle
uk: Очистити фільтр
vi: Xóa bộ lọc
zh_hans: 清除筛选
zh_hant: 清除篩選

# rag.workspace.mention.clearSelected
source: Clear
ar: مسح
de: Löschen
es: Limpiar
fr: Effacer
id: Hapus
it: Cancella
ja: クリア
ko: 지우기
nl: Wissen
pl: Wyczyść
pt_br: Limpar
ru: Очистить
tr: Temizle
uk: Очистити
vi: Xóa
zh_hans: 清空
zh_hant: 清空

# rag.workspace.mention.emptyFilter
source: No matching repositories
ar: لا توجد مستودعات مطابقة
de: Keine passenden Repositories
es: No hay repositorios que coincidan
fr: Aucun dépôt correspondant
id: Tidak ada repositori yang cocok
it: Nessun repository corrispondente
ja: 一致するリポジトリがありません
ko: 일치하는 저장소 없음
nl: Geen overeenkomende repositories
pl: Brak pasujących repozytoriów
pt_br: Nenhum repositório correspondente
ru: Нет подходящих репозиториев
tr: Eşleşen depo bulunamadı
uk: Немає відповідних репозиторіїв
vi: Không có kho lưu trữ phù hợp
zh_hans: 无匹配仓库
zh_hant: 無符合倉庫

# rag.workspace.mention.emptyKnowledge
source: Knowledge base is empty
ar: قاعدة المعرفة فارغة
de: Wissensdatenbank ist leer
es: La base de conocimiento está vacía
fr: La base de connaissances est vide
id: Basis pengetahuan kosong
it: La knowledge base è vuota
ja: ナレッジベースが空です
ko: 지식 베이스가 비어 있습니다
nl: Kennisbank is leeg
pl: Baza wiedzy jest pusta
pt_br: A base de conhecimento está vazia
ru: База знаний пуста
tr: Bilgi tabanı boş
uk: База знань порожня
vi: Cơ sở tri thức trống
zh_hans: 知识库暂无仓库
zh_hant: 知識庫暫無倉庫

# rag.workspace.mention.narrowHint
source: Showing %1$d of %2$d · keep typing to narrow
ar: عرض %1$d من %2$d · استمر في الكتابة للتضييق
de: Zeige %1$d von %2$d · weiter tippen zum Eingrenzen
es: Mostrando %1$d de %2$d · sigue escribiendo para reducir
fr: Affichage de %1$d sur %2$d · continuez à taper pour affiner
id: Menampilkan %1$d dari %2$d · terus mengetik untuk mempersempit
it: Mostrati %1$d di %2$d · continua a digitare per restringere
ja: %1$d / %2$d を表示 · 入力を続けて絞り込み
ko: %1$d / %2$d 표시 중 · 계속 입력하여 좁히기
nl: %1$d van %2$d weergegeven · blijf typen om te verfijnen
pl: Wyświetlono %1$d z %2$d · kontynuuj pisanie, aby zawęzić
pt_br: Mostrando %1$d de %2$d · continue digitando para refinar
ru: Показано %1$d из %2$d · продолжайте ввод для сужения
tr: %1$d / %2$d gösteriliyor · daraltmak için yazmaya devam edin
uk: Показано %1$d із %2$d · продовжуйте вводити для звуження
vi: Hiển thị %1$d trên %2$d · tiếp tục nhập để thu hẹp
zh_hans: 显示 %1$d / 命中 %2$d · 继续输入可缩小范围
zh_hant: 顯示 %1$d / 命中 %2$d · 繼續輸入可縮小範圍

# rag.workspace.mention.searchPlaceholder
source: Search knowledge base repositories
ar: البحث في مستودعات قاعدة المعرفة
de: Wissensdatenbank-Repositories durchsuchen
es: Buscar repositorios de la base de conocimiento
fr: Rechercher dans les dépôts de la base de connaissances
id: Cari repositori basis pengetahuan
it: Cerca repository della knowledge base
ja: ナレッジベースのリポジトリを検索
ko: 지식 베이스 저장소 검색
nl: Doorzoek kennisbankrepositories
pl: Szukaj w repozytoriach bazy wiedzy
pt_br: Pesquisar repositórios da base de conhecimento
ru: Поиск репозиториев базы знаний
tr: Bilgi tabanı depolarını ara
uk: Пошук репозиторіїв бази знань
vi: Tìm kiếm kho lưu trữ cơ sở tri thức
zh_hans: 搜索知识库仓库
zh_hant: 搜尋知識庫倉庫

# rag.workspace.mention.selectionLimit
source: You can select up to %1$d repositories
ar: يمكنك تحديد حتى %1$d مستودع
de: Du kannst bis zu %1$d Repositories auswählen
es: Puedes seleccionar hasta %1$d repositorios
fr: Vous pouvez sélectionner jusqu'à %1$d dépôts
id: Anda dapat memilih hingga %1$d repositori
it: Puoi selezionare fino a %1$d repository
ja: 最大%1$d個のリポジトリを選択できます
ko: 최대 %1$d개 저장소를 선택할 수 있습니다
nl: U kunt maximaal %1$d repositories selecteren
pl: Możesz wybrać maksymalnie %1$d repozytoriów
pt_br: Você pode selecionar até %1$d repositórios
ru: Вы можете выбрать до %1$d репозиториев
tr: En fazla %1$d depo seçebilirsiniz
uk: Можна вибрати до %1$d репозиторіїв
vi: Bạn có thể chọn tối đa %1$d kho lưu trữ
zh_hans: 最多选择 %1$d 个仓库
zh_hant: 最多選擇 %1$d 個倉庫

# rag.workspace.mention.stats
source: Selected %1$d/%2$d · Knowledge %3$d
ar: تم تحديد %1$d/%2$d · المعرفة %3$d
de: Ausgewählt %1$d/%2$d · Wissen %3$d
es: Seleccionados %1$d/%2$d · Conocimiento %3$d
fr: Sélectionnés %1$d/%2$d · Connaissances %3$d
id: Dipilih %1$d/%2$d · Pengetahuan %3$d
it: Selezionati %1$d/%2$d · Knowledge %3$d
ja: 選択 %1$d/%2$d · ナレッジ %3$d
ko: 선택됨 %1$d/%2$d · 지식 %3$d
nl: Geselecteerd %1$d/%2$d · Kennis %3$d
pl: Wybrano %1$d/%2$d · Wiedza %3$d
pt_br: Selecionados %1$d/%2$d · Conhecimento %3$d
ru: Выбрано %1$d/%2$d · Знаний %3$d
tr: Seçilen %1$d/%2$d · Bilgi %3$d
uk: Вибрано %1$d/%2$d · Знання %3$d
vi: Đã chọn %1$d/%2$d · Tri thức %3$d
zh_hans: 已选 %1$d/%2$d · 知识库 %3$d
zh_hant: 已選 %1$d/%2$d · 知識庫 %3$d

# rag.workspace.mention.title
source: Select from the knowledge base
ar: اختر من قاعدة المعرفة
de: Aus der Wissensdatenbank auswählen
es: Seleccionar de la base de conocimiento
fr: Sélectionner dans la base de connaissances
id: Pilih dari basis pengetahuan
it: Seleziona dalla knowledge base
ja: ナレッジベースから選択
ko: 지식 베이스에서 선택
nl: Selecteer uit de kennisbank
pl: Wybierz z bazy wiedzy
pt_br: Selecionar da base de conhecimento
ru: Выбор из базы знаний
tr: Bilgi tabanından seç
uk: Виберіть із бази знань
vi: Chọn từ cơ sở tri thức
zh_hans: 从知识库选择仓库
zh_hant: 從知識庫選擇倉庫
